MikroElektronika/core_packages/PIC32/XC32/def/PIC32MZ2064DAK176/mcu.h
extern volatile __CNENFbits_t CNENFbits __asm__ ("CNENF") __attribute__((section("sfrs"), address(0xBF860580)));
extern volatile uint32_t        CNENFCLR __attribute__((section("sfrs"),address(0xBF860584)));
extern volatile uint32_t        CNENFSET __attribute__((section("sfrs"),address(0xBF860588)));
extern volatile uint32_t        CNENFINV __attribute__((section("sfrs"),address(0xBF86058C)));
#define CNSTATF CNSTATF
extern volatile uint32_t   CNSTATF __attribute__((section("sfrs"), address(0xBF860590)));
typedef union {
  struct {
    uint32_t CNSTATF0:1;
    uint32_t CNSTATF1:1;
    uint32_t CNSTATF2:1;
    uint32_t CNSTATF3:1;
    uint32_t CNSTATF4:1;
    uint32_t CNSTATF5:1;
    uint32_t :2;
    uint32_t CNSTATF8:1;
    uint32_t :3;
    uint32_t CNSTATF12:1;
    uint32_t CNSTATF13:1;
  };
  struct {
    uint32_t w:32;
  };
} __CNSTATFbits_t;
extern volatile __CNSTATFbits_t CNSTATFbits __asm__ ("CNSTATF") __attribute__((section("sfrs"), address(0xBF860590)));
extern volatile uint32_t        CNSTATFCLR __attribute__((section("sfrs"),address(0xBF860594)));
extern volatile uint32_t        CNSTATFSET __attribute__((section("sfrs"),address(0xBF860598)));
extern volatile uint32_t        CNSTATFINV __attribute__((section("sfrs"),address(0xBF86059C)));
#define CNNEF CNNEF
extern volatile uint32_t   CNNEF __attribute__((section("sfrs"), address(0xBF8605A0)));
typedef struct {
  uint32_t CNNEF0:1;
  uint32_t CNNEF1:1;
  uint32_t CNNEF2:1;
  uint32_t CNNEF3:1;
  uint32_t CNNEF4:1;
  uint32_t CNNEF5:1;
  uint32_t :2;
  uint32_t CNNEF8:1;
  uint32_t :3;
  uint32_t CNNEF12:1;
  uint32_t CNNEF13:1;
} __CNNEFbits_t;
extern volatile __CNNEFbits_t CNNEFbits __asm__ ("CNNEF") __attribute__((section("sfrs"), address(0xBF8605A0)));
extern volatile uint32_t        CNNEFCLR __attribute__((section("sfrs"),address(0xBF8605A4)));
extern volatile uint32_t        CNNEFSET __attribute__((section("sfrs"),address(0xBF8605A8)));
extern volatile uint32_t        CNNEFINV __attribute__((section("sfrs"),address(0xBF8605AC)));
#define CNFF CNFF
extern volatile uint32_t   CNFF __attribute__((section("sfrs"), address(0xBF8605B0)));
typedef struct {
  uint32_t CNFF0:1;
  uint32_t CNFF1:1;
  uint32_t CNFF2:1;
  uint32_t CNFF3:1;
  uint32_t CNFF4:1;
  uint32_t CNFF5:1;
  uint32_t :2;
  uint32_t CNFF8:1;
  uint32_t :3;
  uint32_t CNFF12:1;
  uint32_t CNFF13:1;
} __CNFFbits_t;
extern volatile __CNFFbits_t CNFFbits __asm__ ("CNFF") __attribute__((section("sfrs"), address(0xBF8605B0)));
extern volatile uint32_t        CNFFCLR __attribute__((section("sfrs"),address(0xBF8605B4)));
extern volatile uint32_t        CNFFSET __attribute__((section("sfrs"),address(0xBF8605B8)));
extern volatile uint32_t        CNFFINV __attribute__((section("sfrs"),address(0xBF8605BC)));
#define SRCON0F SRCON0F
extern volatile uint32_t   SRCON0F __attribute__((section("sfrs"), address(0xBF8605C0)));
typedef struct {
  uint32_t SR0F0:1;
  uint32_t SR0F1:1;
  uint32_t SR0F2:1;
  uint32_t SR0F3:1;
  uint32_t SR0F4:1;
  uint32_t SR0F5:1;
  uint32_t :2;
  uint32_t SR0F8:1;
  uint32_t :3;
  uint32_t SR0F12:1;
  uint32_t SR0F13:1;
} __SRCON0Fbits_t;
extern volatile __SRCON0Fbits_t SRCON0Fbits __asm__ ("SRCON0F") __attribute__((section("sfrs"), address(0xBF8605C0)));
extern volatile uint32_t        SRCON0FCLR __attribute__((section("sfrs"),address(0xBF8605C4)));
extern volatile uint32_t        SRCON0FSET __attribute__((section("sfrs"),address(0xBF8605C8)));
extern volatile uint32_t        SRCON0FINV __attribute__((section("sfrs"),address(0xBF8605CC)));
#define SRCON1F SRCON1F
extern volatile uint32_t   SRCON1F __attribute__((section("sfrs"), address(0xBF8605D0)));
typedef struct {
  uint32_t SR1F0:1;
  uint32_t SR1F1:1;
  uint32_t SR1F2:1;
  uint32_t SR1F3:1;
  uint32_t SR1F4:1;
  uint32_t SR1F5:1;
  uint32_t :2;
  uint32_t SR1F8:1;
  uint32_t :3;
  uint32_t SR1F12:1;
  uint32_t SR1F13:1;
} __SRCON1Fbits_t;
extern volatile __SRCON1Fbits_t SRCON1Fbits __asm__ ("SRCON1F") __attribute__((section("sfrs"), address(0xBF8605D0)));
extern volatile uint32_t        SRCON1FCLR __attribute__((section("sfrs"),address(0xBF8605D4)));
extern volatile uint32_t        SRCON1FSET __attribute__((section("sfrs"),address(0xBF8605D8)));
extern volatile uint32_t        SRCON1FINV __attribute__((section("sfrs"),address(0xBF8605DC)));
#define ANSELG ANSELG
extern volatile uint32_t   ANSELG __attribute__((section("sfrs"), address(0xBF860600)));
typedef union {
  struct {
    uint32_t :6;
    uint32_t ANSG6:1;
    uint32_t ANSG7:1;
    uint32_t ANSG8:1;
    uint32_t ANSG9:1;
    uint32_t :5;
    uint32_t ANSG15:1;
  };
  struct {
    uint32_t w:32;
  };
} __ANSELGbits_t;
extern volatile __ANSELGbits_t ANSELGbits __asm__ ("ANSELG") __attribute__((section("sfrs"), address(0xBF860600)));
extern volatile uint32_t        ANSELGCLR __attribute__((section("sfrs"),address(0xBF860604)));
extern volatile uint32_t        ANSELGSET __attribute__((section("sfrs"),address(0xBF860608)));
extern volatile uint32_t        ANSELGINV __attribute__((section("sfrs"),address(0xBF86060C)));
#define TRISG TRISG
extern volatile uint32_t   TRISG __attribute__((section("sfrs"), address(0xBF860610)));
typedef union {
  struct {
    uint32_t TRISG0:1;
    uint32_t TRISG1:1;
    uint32_t :4;
    uint32_t TRISG6:1;
    uint32_t TRISG7:1;
    uint32_t TRISG8:1;
    uint32_t TRISG9:1;
    uint32_t :2;
    uint32_t TRISG12:1;
    uint32_t TRISG13:1;
    uint32_t TRISG14:1;
    uint32_t TRISG15:1;
  };
  struct {
    uint32_t w:32;
  };
} __TRISGbits_t;
extern volatile __TRISGbits_t TRISGbits __asm__ ("TRISG") __attribute__((section("sfrs"), address(0xBF860610)));
extern volatile uint32_t        TRISGCLR __attribute__((section("sfrs"),address(0xBF860614)));
extern volatile uint32_t        TRISGSET __attribute__((section("sfrs"),address(0xBF860618)));
extern volatile uint32_t        TRISGINV __attribute__((section("sfrs"),address(0xBF86061C)));
#define PORTG PORTG
extern volatile uint32_t   PORTG __attribute__((section("sfrs"), address(0xBF860620)));
typedef union {
  struct {
    uint32_t RG0:1;
    uint32_t RG1:1;
    uint32_t :4;
    uint32_t RG6:1;
    uint32_t RG7:1;
    uint32_t RG8:1;
    uint32_t RG9:1;
    uint32_t :2;
    uint32_t RG12:1;
    uint32_t RG13:1;
    uint32_t RG14:1;
    uint32_t RG15:1;
  };
  struct {
    uint32_t w:32;
  };
} __PORTGbits_t;
extern volatile __PORTGbits_t PORTGbits __asm__ ("PORTG") __attribute__((section("sfrs"), address(0xBF860620)));
extern volatile uint32_t        PORTGCLR __attribute__((section("sfrs"),address(0xBF860624)));
extern volatile uint32_t        PORTGSET __attribute__((section("sfrs"),address(0xBF860628)));
extern volatile uint32_t        PORTGINV __attribute__((section("sfrs"),address(0xBF86062C)));
#define LATG LATG
extern volatile uint32_t   LATG __attribute__((section("sfrs"), address(0xBF860630)));
typedef union {
  struct {
    uint32_t LATG0:1;
    uint32_t LATG1:1;
    uint32_t :4;
    uint32_t LATG6:1;
    uint32_t LATG7:1;
    uint32_t LATG8:1;
    uint32_t LATG9:1;
    uint32_t :2;
    uint32_t LATG12:1;
    uint32_t LATG13:1;
    uint32_t LATG14:1;
    uint32_t LATG15:1;
  };
  struct {
    uint32_t w:32;
  };
} __LATGbits_t;
