MikroElektronika/core_packages/PIC32/XC32/def/PIC32MZ2064DAK176/mcu.h
#define _GLCDCURDATA17_PIXEL411_POSITION         0x00000010
#define _GLCDCURDATA17_PIXEL411_MASK             0x000F0000
#define _GLCDCURDATA17_PIXEL411_LENGTH           0x00000004

#define _GLCDCURDATA17_PIXEL410_POSITION         0x00000014
#define _GLCDCURDATA17_PIXEL410_MASK             0x00F00000
#define _GLCDCURDATA17_PIXEL410_LENGTH           0x00000004

#define _GLCDCURDATA17_PIXEL49_POSITION          0x00000018
#define _GLCDCURDATA17_PIXEL49_MASK              0x0F000000
#define _GLCDCURDATA17_PIXEL49_LENGTH            0x00000004

#define _GLCDCURDATA17_PIXEL48_POSITION          0x0000001C
#define _GLCDCURDATA17_PIXEL48_MASK              0xF0000000
#define _GLCDCURDATA17_PIXEL48_LENGTH            0x00000004

#define _GLCDCURDATA18_PIXEL423_POSITION         0x00000000
#define _GLCDCURDATA18_PIXEL423_MASK             0x0000000F
#define _GLCDCURDATA18_PIXEL423_LENGTH           0x00000004

#define _GLCDCURDATA18_PIXEL422_POSITION         0x00000004
#define _GLCDCURDATA18_PIXEL422_MASK             0x000000F0
#define _GLCDCURDATA18_PIXEL422_LENGTH           0x00000004

#define _GLCDCURDATA18_PIXEL421_POSITION         0x00000008
#define _GLCDCURDATA18_PIXEL421_MASK             0x00000F00
#define _GLCDCURDATA18_PIXEL421_LENGTH           0x00000004

#define _GLCDCURDATA18_PIXEL420_POSITION         0x0000000C
#define _GLCDCURDATA18_PIXEL420_MASK             0x0000F000
#define _GLCDCURDATA18_PIXEL420_LENGTH           0x00000004

#define _GLCDCURDATA18_PIXEL419_POSITION         0x00000010
#define _GLCDCURDATA18_PIXEL419_MASK             0x000F0000
#define _GLCDCURDATA18_PIXEL419_LENGTH           0x00000004

#define _GLCDCURDATA18_PIXEL418_POSITION         0x00000014
#define _GLCDCURDATA18_PIXEL418_MASK             0x00F00000
#define _GLCDCURDATA18_PIXEL418_LENGTH           0x00000004

#define _GLCDCURDATA18_PIXEL417_POSITION         0x00000018
#define _GLCDCURDATA18_PIXEL417_MASK             0x0F000000
#define _GLCDCURDATA18_PIXEL417_LENGTH           0x00000004

#define _GLCDCURDATA18_PIXEL416_POSITION         0x0000001C
#define _GLCDCURDATA18_PIXEL416_MASK             0xF0000000
#define _GLCDCURDATA18_PIXEL416_LENGTH           0x00000004

#define _GLCDCURDATA19_PIXEL431_POSITION         0x00000000
#define _GLCDCURDATA19_PIXEL431_MASK             0x0000000F
#define _GLCDCURDATA19_PIXEL431_LENGTH           0x00000004

#define _GLCDCURDATA19_PIXEL430_POSITION         0x00000004
#define _GLCDCURDATA19_PIXEL430_MASK             0x000000F0
#define _GLCDCURDATA19_PIXEL430_LENGTH           0x00000004

#define _GLCDCURDATA19_PIXEL429_POSITION         0x00000008
#define _GLCDCURDATA19_PIXEL429_MASK             0x00000F00
#define _GLCDCURDATA19_PIXEL429_LENGTH           0x00000004

#define _GLCDCURDATA19_PIXEL428_POSITION         0x0000000C
#define _GLCDCURDATA19_PIXEL428_MASK             0x0000F000
#define _GLCDCURDATA19_PIXEL428_LENGTH           0x00000004

#define _GLCDCURDATA19_PIXEL427_POSITION         0x00000010
#define _GLCDCURDATA19_PIXEL427_MASK             0x000F0000
#define _GLCDCURDATA19_PIXEL427_LENGTH           0x00000004

#define _GLCDCURDATA19_PIXEL426_POSITION         0x00000014
#define _GLCDCURDATA19_PIXEL426_MASK             0x00F00000
#define _GLCDCURDATA19_PIXEL426_LENGTH           0x00000004

#define _GLCDCURDATA19_PIXEL425_POSITION         0x00000018
#define _GLCDCURDATA19_PIXEL425_MASK             0x0F000000
#define _GLCDCURDATA19_PIXEL425_LENGTH           0x00000004

#define _GLCDCURDATA19_PIXEL424_POSITION         0x0000001C
#define _GLCDCURDATA19_PIXEL424_MASK             0xF0000000
#define _GLCDCURDATA19_PIXEL424_LENGTH           0x00000004

#define _GLCDCURDATA20_PIXEL57_POSITION          0x00000000
#define _GLCDCURDATA20_PIXEL57_MASK              0x0000000F
#define _GLCDCURDATA20_PIXEL57_LENGTH            0x00000004

#define _GLCDCURDATA20_PIXEL56_POSITION          0x00000004
#define _GLCDCURDATA20_PIXEL56_MASK              0x000000F0
#define _GLCDCURDATA20_PIXEL56_LENGTH            0x00000004

#define _GLCDCURDATA20_PIXEL55_POSITION          0x00000008
#define _GLCDCURDATA20_PIXEL55_MASK              0x00000F00
#define _GLCDCURDATA20_PIXEL55_LENGTH            0x00000004

#define _GLCDCURDATA20_PIXEL54_POSITION          0x0000000C
#define _GLCDCURDATA20_PIXEL54_MASK              0x0000F000
#define _GLCDCURDATA20_PIXEL54_LENGTH            0x00000004

#define _GLCDCURDATA20_PIXEL53_POSITION          0x00000010
#define _GLCDCURDATA20_PIXEL53_MASK              0x000F0000
#define _GLCDCURDATA20_PIXEL53_LENGTH            0x00000004

#define _GLCDCURDATA20_PIXEL52_POSITION          0x00000014
#define _GLCDCURDATA20_PIXEL52_MASK              0x00F00000
#define _GLCDCURDATA20_PIXEL52_LENGTH            0x00000004

#define _GLCDCURDATA20_PIXEL51_POSITION          0x00000018
#define _GLCDCURDATA20_PIXEL51_MASK              0x0F000000
#define _GLCDCURDATA20_PIXEL51_LENGTH            0x00000004

#define _GLCDCURDATA20_PIXEL50_POSITION          0x0000001C
#define _GLCDCURDATA20_PIXEL50_MASK              0xF0000000
#define _GLCDCURDATA20_PIXEL50_LENGTH            0x00000004

#define _GLCDCURDATA21_PIXEL515_POSITION         0x00000000
#define _GLCDCURDATA21_PIXEL515_MASK             0x0000000F
#define _GLCDCURDATA21_PIXEL515_LENGTH           0x00000004

#define _GLCDCURDATA21_PIXEL514_POSITION         0x00000004
#define _GLCDCURDATA21_PIXEL514_MASK             0x000000F0
#define _GLCDCURDATA21_PIXEL514_LENGTH           0x00000004

#define _GLCDCURDATA21_PIXEL513_POSITION         0x00000008
#define _GLCDCURDATA21_PIXEL513_MASK             0x00000F00
#define _GLCDCURDATA21_PIXEL513_LENGTH           0x00000004

#define _GLCDCURDATA21_PIXEL512_POSITION         0x0000000C
#define _GLCDCURDATA21_PIXEL512_MASK             0x0000F000
#define _GLCDCURDATA21_PIXEL512_LENGTH           0x00000004

#define _GLCDCURDATA21_PIXEL511_POSITION         0x00000010
#define _GLCDCURDATA21_PIXEL511_MASK             0x000F0000
#define _GLCDCURDATA21_PIXEL511_LENGTH           0x00000004

#define _GLCDCURDATA21_PIXEL510_POSITION         0x00000014
#define _GLCDCURDATA21_PIXEL510_MASK             0x00F00000
#define _GLCDCURDATA21_PIXEL510_LENGTH           0x00000004

#define _GLCDCURDATA21_PIXEL59_POSITION          0x00000018
#define _GLCDCURDATA21_PIXEL59_MASK              0x0F000000
#define _GLCDCURDATA21_PIXEL59_LENGTH            0x00000004

#define _GLCDCURDATA21_PIXEL58_POSITION          0x0000001C
#define _GLCDCURDATA21_PIXEL58_MASK              0xF0000000
#define _GLCDCURDATA21_PIXEL58_LENGTH            0x00000004

#define _GLCDCURDATA22_PIXEL523_POSITION         0x00000000
#define _GLCDCURDATA22_PIXEL523_MASK             0x0000000F
#define _GLCDCURDATA22_PIXEL523_LENGTH           0x00000004

#define _GLCDCURDATA22_PIXEL522_POSITION         0x00000004
#define _GLCDCURDATA22_PIXEL522_MASK             0x000000F0
#define _GLCDCURDATA22_PIXEL522_LENGTH           0x00000004

