MikroElektronika/core_packages/PIC32/XC32/def/PIC32MZ2064DAK176/mcu.h
#define _GLCDCURDATA101_PIXEL2513_POSITION       0x00000008
#define _GLCDCURDATA101_PIXEL2513_MASK           0x00000F00
#define _GLCDCURDATA101_PIXEL2513_LENGTH         0x00000004

#define _GLCDCURDATA101_PIXEL2512_POSITION       0x0000000C
#define _GLCDCURDATA101_PIXEL2512_MASK           0x0000F000
#define _GLCDCURDATA101_PIXEL2512_LENGTH         0x00000004

#define _GLCDCURDATA101_PIXEL2511_POSITION       0x00000010
#define _GLCDCURDATA101_PIXEL2511_MASK           0x000F0000
#define _GLCDCURDATA101_PIXEL2511_LENGTH         0x00000004

#define _GLCDCURDATA101_PIXEL2510_POSITION       0x00000014
#define _GLCDCURDATA101_PIXEL2510_MASK           0x00F00000
#define _GLCDCURDATA101_PIXEL2510_LENGTH         0x00000004

#define _GLCDCURDATA101_PIXEL259_POSITION        0x00000018
#define _GLCDCURDATA101_PIXEL259_MASK            0x0F000000
#define _GLCDCURDATA101_PIXEL259_LENGTH          0x00000004

#define _GLCDCURDATA101_PIXEL258_POSITION        0x0000001C
#define _GLCDCURDATA101_PIXEL258_MASK            0xF0000000
#define _GLCDCURDATA101_PIXEL258_LENGTH          0x00000004

#define _GLCDCURDATA102_PIXEL2523_POSITION       0x00000000
#define _GLCDCURDATA102_PIXEL2523_MASK           0x0000000F
#define _GLCDCURDATA102_PIXEL2523_LENGTH         0x00000004

#define _GLCDCURDATA102_PIXEL2522_POSITION       0x00000004
#define _GLCDCURDATA102_PIXEL2522_MASK           0x000000F0
#define _GLCDCURDATA102_PIXEL2522_LENGTH         0x00000004

#define _GLCDCURDATA102_PIXEL2521_POSITION       0x00000008
#define _GLCDCURDATA102_PIXEL2521_MASK           0x00000F00
#define _GLCDCURDATA102_PIXEL2521_LENGTH         0x00000004

#define _GLCDCURDATA102_PIXEL2520_POSITION       0x0000000C
#define _GLCDCURDATA102_PIXEL2520_MASK           0x0000F000
#define _GLCDCURDATA102_PIXEL2520_LENGTH         0x00000004

#define _GLCDCURDATA102_PIXEL2519_POSITION       0x00000010
#define _GLCDCURDATA102_PIXEL2519_MASK           0x000F0000
#define _GLCDCURDATA102_PIXEL2519_LENGTH         0x00000004

#define _GLCDCURDATA102_PIXEL2518_POSITION       0x00000014
#define _GLCDCURDATA102_PIXEL2518_MASK           0x00F00000
#define _GLCDCURDATA102_PIXEL2518_LENGTH         0x00000004

#define _GLCDCURDATA102_PIXEL2517_POSITION       0x00000018
#define _GLCDCURDATA102_PIXEL2517_MASK           0x0F000000
#define _GLCDCURDATA102_PIXEL2517_LENGTH         0x00000004

#define _GLCDCURDATA102_PIXEL2516_POSITION       0x0000001C
#define _GLCDCURDATA102_PIXEL2516_MASK           0xF0000000
#define _GLCDCURDATA102_PIXEL2516_LENGTH         0x00000004

#define _GLCDCURDATA103_PIXEL2531_POSITION       0x00000000
#define _GLCDCURDATA103_PIXEL2531_MASK           0x0000000F
#define _GLCDCURDATA103_PIXEL2531_LENGTH         0x00000004

#define _GLCDCURDATA103_PIXEL2530_POSITION       0x00000004
#define _GLCDCURDATA103_PIXEL2530_MASK           0x000000F0
#define _GLCDCURDATA103_PIXEL2530_LENGTH         0x00000004

#define _GLCDCURDATA103_PIXEL2529_POSITION       0x00000008
#define _GLCDCURDATA103_PIXEL2529_MASK           0x00000F00
#define _GLCDCURDATA103_PIXEL2529_LENGTH         0x00000004

#define _GLCDCURDATA103_PIXEL2528_POSITION       0x0000000C
#define _GLCDCURDATA103_PIXEL2528_MASK           0x0000F000
#define _GLCDCURDATA103_PIXEL2528_LENGTH         0x00000004

#define _GLCDCURDATA103_PIXEL2527_POSITION       0x00000010
#define _GLCDCURDATA103_PIXEL2527_MASK           0x000F0000
#define _GLCDCURDATA103_PIXEL2527_LENGTH         0x00000004

#define _GLCDCURDATA103_PIXEL2526_POSITION       0x00000014
#define _GLCDCURDATA103_PIXEL2526_MASK           0x00F00000
#define _GLCDCURDATA103_PIXEL2526_LENGTH         0x00000004

#define _GLCDCURDATA103_PIXEL2525_POSITION       0x00000018
#define _GLCDCURDATA103_PIXEL2525_MASK           0x0F000000
#define _GLCDCURDATA103_PIXEL2525_LENGTH         0x00000004

#define _GLCDCURDATA103_PIXEL2524_POSITION       0x0000001C
#define _GLCDCURDATA103_PIXEL2524_MASK           0xF0000000
#define _GLCDCURDATA103_PIXEL2524_LENGTH         0x00000004

#define _GLCDCURDATA104_PIXEL267_POSITION        0x00000000
#define _GLCDCURDATA104_PIXEL267_MASK            0x0000000F
#define _GLCDCURDATA104_PIXEL267_LENGTH          0x00000004

#define _GLCDCURDATA104_PIXEL266_POSITION        0x00000004
#define _GLCDCURDATA104_PIXEL266_MASK            0x000000F0
#define _GLCDCURDATA104_PIXEL266_LENGTH          0x00000004

#define _GLCDCURDATA104_PIXEL265_POSITION        0x00000008
#define _GLCDCURDATA104_PIXEL265_MASK            0x00000F00
#define _GLCDCURDATA104_PIXEL265_LENGTH          0x00000004

#define _GLCDCURDATA104_PIXEL264_POSITION        0x0000000C
#define _GLCDCURDATA104_PIXEL264_MASK            0x0000F000
#define _GLCDCURDATA104_PIXEL264_LENGTH          0x00000004

#define _GLCDCURDATA104_PIXEL263_POSITION        0x00000010
#define _GLCDCURDATA104_PIXEL263_MASK            0x000F0000
#define _GLCDCURDATA104_PIXEL263_LENGTH          0x00000004

#define _GLCDCURDATA104_PIXEL262_POSITION        0x00000014
#define _GLCDCURDATA104_PIXEL262_MASK            0x00F00000
#define _GLCDCURDATA104_PIXEL262_LENGTH          0x00000004

#define _GLCDCURDATA104_PIXEL261_POSITION        0x00000018
#define _GLCDCURDATA104_PIXEL261_MASK            0x0F000000
#define _GLCDCURDATA104_PIXEL261_LENGTH          0x00000004

#define _GLCDCURDATA104_PIXEL260_POSITION        0x0000001C
#define _GLCDCURDATA104_PIXEL260_MASK            0xF0000000
#define _GLCDCURDATA104_PIXEL260_LENGTH          0x00000004

#define _GLCDCURDATA105_PIXEL2615_POSITION       0x00000000
#define _GLCDCURDATA105_PIXEL2615_MASK           0x0000000F
#define _GLCDCURDATA105_PIXEL2615_LENGTH         0x00000004

#define _GLCDCURDATA105_PIXEL2614_POSITION       0x00000004
#define _GLCDCURDATA105_PIXEL2614_MASK           0x000000F0
#define _GLCDCURDATA105_PIXEL2614_LENGTH         0x00000004

#define _GLCDCURDATA105_PIXEL2613_POSITION       0x00000008
#define _GLCDCURDATA105_PIXEL2613_MASK           0x00000F00
#define _GLCDCURDATA105_PIXEL2613_LENGTH         0x00000004

#define _GLCDCURDATA105_PIXEL2612_POSITION       0x0000000C
#define _GLCDCURDATA105_PIXEL2612_MASK           0x0000F000
#define _GLCDCURDATA105_PIXEL2612_LENGTH         0x00000004

#define _GLCDCURDATA105_PIXEL2611_POSITION       0x00000010
#define _GLCDCURDATA105_PIXEL2611_MASK           0x000F0000
#define _GLCDCURDATA105_PIXEL2611_LENGTH         0x00000004

#define _GLCDCURDATA105_PIXEL2610_POSITION       0x00000014
#define _GLCDCURDATA105_PIXEL2610_MASK           0x00F00000
#define _GLCDCURDATA105_PIXEL2610_LENGTH         0x00000004

