MikroElektronika/core_packages/PIC32/XC32/def/PIC32MZ2064DAK176/mcu.h
#define _ABF2DEVCFG0_JTAGEN_POSITION             0x00000002
#define _ABF2DEVCFG0_JTAGEN_MASK                 0x00000004
#define _ABF2DEVCFG0_JTAGEN_LENGTH               0x00000001

#define _ABF2DEVCFG0_ICESEL_POSITION             0x00000003
#define _ABF2DEVCFG0_ICESEL_MASK                 0x00000018
#define _ABF2DEVCFG0_ICESEL_LENGTH               0x00000002

#define _ABF2DEVCFG0_TRCEN_POSITION              0x00000005
#define _ABF2DEVCFG0_TRCEN_MASK                  0x00000020
#define _ABF2DEVCFG0_TRCEN_LENGTH                0x00000001

#define _ABF2DEVCFG0_BOOTISA_POSITION            0x00000006
#define _ABF2DEVCFG0_BOOTISA_MASK                0x00000040
#define _ABF2DEVCFG0_BOOTISA_LENGTH              0x00000001

#define _ABF2DEVCFG0_FECCCON_POSITION            0x00000008
#define _ABF2DEVCFG0_FECCCON_MASK                0x00000300
#define _ABF2DEVCFG0_FECCCON_LENGTH              0x00000002

#define _ABF2DEVCFG0_FSLEEP_POSITION             0x0000000A
#define _ABF2DEVCFG0_FSLEEP_MASK                 0x00000400
#define _ABF2DEVCFG0_FSLEEP_LENGTH               0x00000001

#define _ABF2DEVCFG0_DBGPER_POSITION             0x0000000C
#define _ABF2DEVCFG0_DBGPER_MASK                 0x00007000
#define _ABF2DEVCFG0_DBGPER_LENGTH               0x00000003

#define _ABF2DEVCFG0_SMCLR_POSITION              0x0000000F
#define _ABF2DEVCFG0_SMCLR_MASK                  0x00008000
#define _ABF2DEVCFG0_SMCLR_LENGTH                0x00000001

#define _ABF2DEVCFG0_SOSCGAIN_POSITION           0x00000010
#define _ABF2DEVCFG0_SOSCGAIN_MASK               0x00030000
#define _ABF2DEVCFG0_SOSCGAIN_LENGTH             0x00000002

#define _ABF2DEVCFG0_SOSCBOOST_POSITION          0x00000012
#define _ABF2DEVCFG0_SOSCBOOST_MASK              0x00040000
#define _ABF2DEVCFG0_SOSCBOOST_LENGTH            0x00000001

#define _ABF2DEVCFG0_POSCGAIN_POSITION           0x00000013
#define _ABF2DEVCFG0_POSCGAIN_MASK               0x00180000
#define _ABF2DEVCFG0_POSCGAIN_LENGTH             0x00000002

#define _ABF2DEVCFG0_POSCBOOST_POSITION          0x00000015
#define _ABF2DEVCFG0_POSCBOOST_MASK              0x00200000
#define _ABF2DEVCFG0_POSCBOOST_LENGTH            0x00000001

#define _ABF2DEVCFG0_POSCFGAIN_POSITION          0x00000016
#define _ABF2DEVCFG0_POSCFGAIN_MASK              0x00C00000
#define _ABF2DEVCFG0_POSCFGAIN_LENGTH            0x00000002

#define _ABF2DEVCFG0_POSCTYPE_POSITION           0x00000018
#define _ABF2DEVCFG0_POSCTYPE_MASK               0x03000000
#define _ABF2DEVCFG0_POSCTYPE_LENGTH             0x00000002

#define _ABF2DEVCFG0_POSCAGCRNG_POSITION         0x0000001A
#define _ABF2DEVCFG0_POSCAGCRNG_MASK             0x04000000
#define _ABF2DEVCFG0_POSCAGCRNG_LENGTH           0x00000001

#define _ABF2DEVCFG0_POSCAGC_POSITION            0x0000001B
#define _ABF2DEVCFG0_POSCAGC_MASK                0x08000000
#define _ABF2DEVCFG0_POSCAGC_LENGTH              0x00000001

#define _ABF2DEVCFG0_EJTAGBEN_POSITION           0x0000001E
#define _ABF2DEVCFG0_EJTAGBEN_MASK               0x40000000
#define _ABF2DEVCFG0_EJTAGBEN_LENGTH             0x00000001

#define _ABF2DEVCFG0_POSCAGCDLY_POSITION         0x00000018
#define _ABF2DEVCFG0_POSCAGCDLY_MASK             0x03000000
#define _ABF2DEVCFG0_POSCAGCDLY_LENGTH           0x00000002

#define _ABF2DEVCFG0_FDEBUG_POSITION             0x00000000
#define _ABF2DEVCFG0_FDEBUG_MASK                 0x00000003
#define _ABF2DEVCFG0_FDEBUG_LENGTH               0x00000002

#define _ABF2DEVCFG0_w_POSITION                  0x00000000
#define _ABF2DEVCFG0_w_MASK                      0xFFFFFFFF
#define _ABF2DEVCFG0_w_LENGTH                    0x00000020

#define _ABF2DEVCP0_CP_POSITION                  0x0000001C
#define _ABF2DEVCP0_CP_MASK                      0x10000000
#define _ABF2DEVCP0_CP_LENGTH                    0x00000001

#define _ABF2DEVCP0_w_POSITION                   0x00000000
#define _ABF2DEVCP0_w_MASK                       0xFFFFFFFF
#define _ABF2DEVCP0_w_LENGTH                     0x00000020

#define _ABF2SEQ3_TSEQ_POSITION                  0x00000000
#define _ABF2SEQ3_TSEQ_MASK                      0x0000FFFF
#define _ABF2SEQ3_TSEQ_LENGTH                    0x00000010

#define _ABF2SEQ3_CSEQ_POSITION                  0x00000010
#define _ABF2SEQ3_CSEQ_MASK                      0xFFFF0000
#define _ABF2SEQ3_CSEQ_LENGTH                    0x00000010

#define _ABF2SEQ3_w_POSITION                     0x00000000
#define _ABF2SEQ3_w_MASK                         0xFFFFFFFF
#define _ABF2SEQ3_w_LENGTH                       0x00000020

#define _BF2DEVCFG4_SWDTPS_POSITION              0x00000018
#define _BF2DEVCFG4_SWDTPS_MASK                  0x1F000000
#define _BF2DEVCFG4_SWDTPS_LENGTH                0x00000005

#define _BF2DEVCFG4_w_POSITION                   0x00000000
#define _BF2DEVCFG4_w_MASK                       0xFFFFFFFF
#define _BF2DEVCFG4_w_LENGTH                     0x00000020

#define _BF2DEVCFG3_USERID_POSITION              0x00000000
#define _BF2DEVCFG3_USERID_MASK                  0x0000FFFF
#define _BF2DEVCFG3_USERID_LENGTH                0x00000010

#define _BF2DEVCFG3_FMIIEN_POSITION              0x00000018
#define _BF2DEVCFG3_FMIIEN_MASK                  0x01000000
#define _BF2DEVCFG3_FMIIEN_LENGTH                0x00000001

#define _BF2DEVCFG3_FETHIO_POSITION              0x00000019
#define _BF2DEVCFG3_FETHIO_MASK                  0x02000000
#define _BF2DEVCFG3_FETHIO_LENGTH                0x00000001

#define _BF2DEVCFG3_PGL1WAY_POSITION             0x0000001B
#define _BF2DEVCFG3_PGL1WAY_MASK                 0x08000000
#define _BF2DEVCFG3_PGL1WAY_LENGTH               0x00000001

#define _BF2DEVCFG3_PMDL1WAY_POSITION            0x0000001C
#define _BF2DEVCFG3_PMDL1WAY_MASK                0x10000000
#define _BF2DEVCFG3_PMDL1WAY_LENGTH              0x00000001

#define _BF2DEVCFG3_IOL1WAY_POSITION             0x0000001D
#define _BF2DEVCFG3_IOL1WAY_MASK                 0x20000000
#define _BF2DEVCFG3_IOL1WAY_LENGTH               0x00000001

#define _BF2DEVCFG3_w_POSITION                   0x00000000
#define _BF2DEVCFG3_w_MASK                       0xFFFFFFFF
#define _BF2DEVCFG3_w_LENGTH                     0x00000020

#define _BF2DEVCFG2_FPLLIDIV_POSITION            0x00000000
#define _BF2DEVCFG2_FPLLIDIV_MASK                0x00000007
#define _BF2DEVCFG2_FPLLIDIV_LENGTH              0x00000003

#define _BF2DEVCFG2_FPLLRNG_POSITION             0x00000004
#define _BF2DEVCFG2_FPLLRNG_MASK                 0x00000070
#define _BF2DEVCFG2_FPLLRNG_LENGTH               0x00000003

